storage-disk-test-data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2018-01-31 Wed 00:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>Disk Testing Data</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yanyg" />
</head>
<body>
<div id="content">
<h1 class="title">Disk Testing Data</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org87b7f63">1. Test tools</a>
<ul>
<li><a href="#org83e1ae0">1.1. dd</a></li>
<li><a href="#orgae0bc77">1.2. fio</a></li>
<li><a href="#org03eb3a8">1.3. iometer</a></li>
</ul>
</li>
<li><a href="#org96a1e82">2. Basic Rules</a></li>
<li><a href="#orgff6862f">3. SATA HDD</a>
<ul>
<li><a href="#orgf9e17bd">3.1. T440P硬盘光驱位接入HGST 7.2K/1TB硬盘的测试数据, 64K性能是512B性能的</a>
<ul>
<li><a href="#org9ce82c6">3.1.1. Disk infomation</a></li>
<li><a href="#orgb525cc4">3.1.2. dd test</a></li>
<li><a href="#org3fc629b">3.1.3. FIO</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8e16875">4. SAS HDD</a></li>
<li><a href="#orgfc7af1c">5. SATA SSD</a></li>
<li><a href="#org3af54b7">6. SAS SSD</a></li>
<li><a href="#org1f0c76b">7. NVMe SSD</a></li>
</ul>
</div>
</div>

<div id="outline-container-org87b7f63" class="outline-2">
<h2 id="org87b7f63"><span class="section-number-2">1</span> Test tools</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org83e1ae0" class="outline-3">
<h3 id="org83e1ae0"><span class="section-number-3">1.1</span> dd</h3>
</div>
<div id="outline-container-orgae0bc77" class="outline-3">
<h3 id="orgae0bc77"><span class="section-number-3">1.2</span> fio</h3>
</div>
<div id="outline-container-org03eb3a8" class="outline-3">
<h3 id="org03eb3a8"><span class="section-number-3">1.3</span> iometer</h3>
</div>
</div>

<div id="outline-container-org96a1e82" class="outline-2">
<h2 id="org96a1e82"><span class="section-number-2">2</span> Basic Rules</h2>
<div class="outline-text-2" id="text-2">
<p>
访问硬盘时, LBA数值越小(靠近外圈), 块越大, 顺序特征越好, 读写性能越好.
</p>
</div>
</div>

<div id="outline-container-orgff6862f" class="outline-2">
<h2 id="orgff6862f"><span class="section-number-2">3</span> SATA HDD</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf9e17bd" class="outline-3">
<h3 id="orgf9e17bd"><span class="section-number-3">3.1</span> T440P硬盘光驱位接入HGST 7.2K/1TB硬盘的测试数据, 64K性能是512B性能的</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org9ce82c6" class="outline-4">
<h4 id="org9ce82c6"><span class="section-number-4">3.1.1</span> Disk infomation</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-conf">Model Family:     HGST Travelstar 7K1000
Device Model:     HGST HTS721010A9E630
Serial Number:    JG40006PG9Z3RC
LU WWN Device Id: 5 000cca 6acc48868
Firmware Version: JB0OA3B0
User Capacity:    1,000,204,886,016 bytes [1.00 TB]
Sector Sizes:     512 bytes logical, 4096 bytes physical
Rotation Rate:    7200 rpm
Form Factor:      2.5 inches
Device is:        In smartctl database [for details use: -P show]
ATA Version is:   ATA8-ACS T13/1699-D revision 6
SATA Version is:  SATA 2.6, 6.0 Gb/s (current: 6.0 Gb/s)
Local Time is:    Wed Jul 26 22:08:15 2017 CST
SMART support is: Available - device has SMART capability.
SMART support is: Enabled
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb525cc4" class="outline-4">
<h4 id="orgb525cc4"><span class="section-number-4">3.1.2</span> dd test</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
简单查看结果可知, 64K性能是512B性能的15倍.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">bs=512 offset 0</span>
~$ sudo dd <span class="org-variable-name">if</span>=/dev/sdb <span class="org-variable-name">of</span>=/dev/null <span class="org-variable-name">bs</span>=512 <span class="org-variable-name">count</span>=100K <span class="org-variable-name">iflag</span>=direct
102400+0 records<span class="org-keyword"> in</span>
102400+0 records out
52428800 bytes (52 MB) copied, 6.28613 s, 8.3 MB/s

<span class="org-comment-delimiter"># </span><span class="org-comment">bs=512 offset 500GB</span>
~$ sudo dd <span class="org-variable-name">if</span>=/dev/sdb <span class="org-variable-name">of</span>=/dev/null <span class="org-variable-name">bs</span>=512 <span class="org-variable-name">count</span>=100K <span class="org-variable-name">skip</span>=1G <span class="org-variable-name">iflag</span>=direct
102400+0 records<span class="org-keyword"> in</span>
102400+0 records out
52428800 bytes (52 MB) copied, 6.80958 s, 7.7 MB/s

<span class="org-comment-delimiter"># </span><span class="org-comment">bs=64K offset 0</span>
~$ sudo dd <span class="org-variable-name">if</span>=/dev/sdb <span class="org-variable-name">of</span>=/dev/null <span class="org-variable-name">bs</span>=64K <span class="org-variable-name">count</span>=10K <span class="org-variable-name">iflag</span>=direct
10240+0 records<span class="org-keyword"> in</span>
10240+0 records out
671088640 bytes (671 MB) copied, 5.20339 s, 129 MB/s

<span class="org-comment-delimiter"># </span><span class="org-comment">bs=64K offset 500GB</span>
~$ sudo dd <span class="org-variable-name">if</span>=/dev/sdb <span class="org-variable-name">of</span>=/dev/null <span class="org-variable-name">bs</span>=64K <span class="org-variable-name">count</span>=10K <span class="org-variable-name">skip</span>=8M <span class="org-variable-name">iflag</span>=direct
10240+0 records<span class="org-keyword"> in</span>
10240+0 records out
671088640 bytes (671 MB) copied, 6.36875 s, 105 MB/s

<span class="org-comment-delimiter"># </span><span class="org-comment">bs=64K offset 896GB</span>
~$ sudo dd <span class="org-variable-name">if</span>=/dev/sdb <span class="org-variable-name">of</span>=/dev/null <span class="org-variable-name">bs</span>=64K <span class="org-variable-name">count</span>=10K <span class="org-variable-name">skip</span>=14M <span class="org-variable-name">iflag</span>=direct
10240+0 records<span class="org-keyword"> in</span>
10240+0 records out
671088640 bytes (671 MB) copied, 9.24369 s, 72.6 MB/s
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fc629b" class="outline-4">
<h4 id="org3fc629b"><span class="section-number-4">3.1.3</span> FIO</h4>
</div>
</div>
</div>

<div id="outline-container-org8e16875" class="outline-2">
<h2 id="org8e16875"><span class="section-number-2">4</span> SAS HDD</h2>
</div>

<div id="outline-container-orgfc7af1c" class="outline-2">
<h2 id="orgfc7af1c"><span class="section-number-2">5</span> SATA SSD</h2>
</div>

<div id="outline-container-org3af54b7" class="outline-2">
<h2 id="org3af54b7"><span class="section-number-2">6</span> SAS SSD</h2>
</div>

<div id="outline-container-org1f0c76b" class="outline-2">
<h2 id="org1f0c76b"><span class="section-number-2">7</span> NVMe SSD</h2>
</div>
</div>
<div id="postamble" class="status">
MainPages 2012-2020 Copyright&copy; <i> YANYG - Powered by Emacs Orgmode</i>
</div>
</body>
</html>
